{
  "name": "Alvaro Bramastio",
  "contact": {
    "Email": "alvarobramastio@gmail.com",
    "WhatsApp": "+6283137370436"
  },
  "summary": "Senior Shopify Developer (Shopify / Shopify Plus) with 6+ years building high-converting, high-performance eCommerce experiences. Specialized in Online Store 2.0 theme development (Liquid), custom sections, and modern headless storefronts with Hydrogen/React and Next.js. Strong track record integrating Shopify Admin + Storefront APIs (GraphQL), implementing checkout and cart UX, improving Core Web Vitals/SEO, and collaborating cross-functionally with design, marketing, and ops. Comfortable leading delivery, mentoring engineers, and owning production storefront reliability.",
  "references": [],
  "experience": [
    {
      "title": "Senior Shopify Developer / Frontend Engineer",
      "company": "TechBubble",
      "period": "Oct 2024 - Oct 2025",
      "skills": [
        "Shopify",
        "Shopify Plus",
        "Online Store 2.0",
        "Liquid",
        "Shopify CLI",
        "Theme Architecture",
        "Hydrogen",
        "Oxygen",
        "React",
        "Next.js",
        "TypeScript",
        "GraphQL",
        "Shopify Admin API",
        "Shopify Storefront API",
        "HTML",
        "CSS",
        "JavaScript",
        "TailwindCSS",
        "Figma",
        "SEO",
        "Core Web Vitals"
      ],
      "summary": "Led Shopify Plus storefront development across theme and headless builds, focusing on conversion, performance, and maintainability. Owned key integrations and ensured high-quality releases through strong engineering practices and collaboration with stakeholders.",
      "highlights": [
        "Built and maintained Online Store 2.0 themes using Liquid, JSON templates, sections, and metafields—enabling non-technical teams to ship content changes safely.",
        "Delivered Shopify Plus enhancements (promotion logic, bundles, upsells, recommendations) and improved UX across PDP/PLP/cart, driving better conversion and AOV.",
        "Integrated Shopify Admin + Storefront APIs (GraphQL) for product, collection, cart, and customer flows; implemented robust error handling and analytics instrumentation.",
        "Optimized storefront performance and SEO (Core Web Vitals, image strategy, caching, critical CSS, code splitting) to improve speed and search visibility.",
        "Implemented accessible, responsive UI components in React/Next.js and Hydrogen with a component-driven architecture and reusable design patterns.",
        "Collaborated with design, marketing, and operations to deliver pixel-perfect experiences and reliable releases (Git-based workflows, CI/CD, release notes).",
        "Mentored junior engineers via code reviews and pairing; raised quality bar around maintainability, testing strategy, and incident prevention."
      ]
    },
    {
      "title": "Frontend Engineer (eCommerce)",
      "company": "PT.Arkamaya",
      "period": "Feb 2022 - Sep 2024",
      "skills": [
        "React",
        "Next.js",
        "TypeScript",
        "TailwindCSS",
        "JavaScript",
        "HTML",
        "CSS",
        "RESTful APIs",
        "GraphQL",
        "Webpack",
        "CircleCI"
      ],
      "summary": "Built scalable, component-driven frontends for commerce and content-heavy applications, emphasizing performance, accessibility, and a clean UI architecture.",
      "highlights": [
        "Developed server-rendered applications with Next.js; improved performance and SEO through route-level optimizations and rendering strategies.",
        "Designed reusable UI components and patterns (forms, navigation, product listing layouts) to speed delivery and improve consistency.",
        "Implemented accessibility best practices (semantic HTML, keyboard navigation, ARIA) and improved responsive behavior across devices.",
        "Integrated REST/GraphQL APIs and established front-end data handling patterns (caching, pagination, optimistic UI).",
        "Partnered with design teams to deliver pixel-perfect UI with strong attention to performance, maintainability, and cross-browser behavior."
      ]
    },
    {
      "title": "Web Developer",
      "company": "WIT. Indonesia",
      "period": "Sep 2019 - Dec 2021",
      "skills": [],
      "summary": "I build clean, responsive, and accessible user interfaces with a strong focus on usability, performance, and design precision. I enjoy transforming complex ideas into intuitive, user-friendly web applications and continuously improving both code quality and user experience.",
      "highlights": [
        "Developed fully responsive layouts using HTML5, CSS3, and JavaScript — ensuring seamless performance across all devices and browsers.",
        "Implemented pixel-perfect designs and optimized pages for speed and accessibility.",
        "Wrote semantic, maintainable code with a focus on best practices and reusability.",
        "Partnered closely with design and backend teams to bring mockups and business logic to life through functional, elegant interfaces.",
        "Built applications with React and TypeScript, leveraging lazy loading and performance patterns for faster UX.",
        "Created modular, reusable components and established routing/guard patterns to enhance maintainability and security.",
        "Worked in Agile teams, contributing to code reviews, architecture planning, and continuous improvement."
      ]
    }
  ],
  "skills": {
    "Shopify & eCommerce": [
      "Shopify",
      "Shopify Plus",
      "Online Store 2.0",
      "Liquid",
      "Theme Architecture (sections, blocks, JSON templates)",
      "Metafields & Metaobjects",
      "Shopify Admin API (GraphQL)",
      "Shopify Storefront API (GraphQL)",
      "Hydrogen (Remix)",
      "Oxygen",
      "Checkout & Cart UX",
      "Checkout Extensibility (UI extensions)",
      "Shopify Functions (discounts)",
      "Shopify Flow",
      "Storefront Performance & CRO",
      "SEO (structured data, sitemaps, metadata)"
    ],
    "Frontend": [
      "React",
      "Next.js",
      "TypeScript",
      "JavaScript",
      "HTML",
      "CSS",
      "TailwindCSS",
      "Accessibility (WCAG)",
      "Component-driven UI architecture",
      "Performance optimization (Core Web Vitals)"
    ],
    "Integrations & Backend (for Shopify)": [
      "Node.js",
      "Express",
      "RESTful APIs",
      "GraphQL",
      "Webhooks",
      "Auth & OAuth (app integrations)",
      "Redis (caching)"
    ],
    "Testing": [
      "Jest",
      "Cypress"
    ],
    "DevOps & Tooling": [
      "Shopify CLI",
      "Git",
      "GitHub Actions",
      "CircleCI",
      "Vercel",
      "AWS",
      "Docker"
    ],
    "Collaboration": [
      "Agile Methodology",
      "Jira",
      "Confluence",
      "Figma"
    ]
  },
  "education": {
    "degree": "Bachelor of Computer Science",
    "university": "Bandung Institute of Technology (ITB)",
    "period": "2015 - 2019"
  }
}